# **Chapter 10: Data Aggregation and Group Operations**

In [3]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                                         'key2' : ['one', 'two', 'one', 'two', 'one'],
                                        'data1' : np.random.randn(5),
                                         'data2' : np.random.randn(5)})

In [4]:
df

  key1 key2     data1     data2
0    a  one -1.818597  0.137103
1    a  two -1.483110  0.493212
2    b  one -1.915172 -0.532030
3    b  two -0.084684  0.548478
4    a  one  0.517012  0.053347

In [5]:
grouped = df['data1'].groupby(df['key1'])

In [6]:
grouped

In [8]:
grouped.mean()

key1
a   -0.928232
b   -0.999928
Name: data1, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [10]:
means

key1  key2
a     one    -0.650793
      two    -1.483110
b     one    -1.915172
      two    -0.084684
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a    -0.650793 -1.483110
b    -1.915172 -0.084684

In [12]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [13]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [14]:
df['data1'].groupby([states, years]).mean()

California  2005   -1.483110
            2006   -1.915172
Ohio        2005   -0.951641
            2006    0.517012
Name: data1, dtype: float64

In [15]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.928232  0.227887
b    -0.999928  0.008224

In [16]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.650793  0.095225
     two  -1.483110  0.493212
b    one  -1.915172 -0.532030
     two  -0.084684  0.548478

In [17]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64